CSI API ETABS v1
cFrameObj.GetLateralBracing Method
 Retrieves the lateral bracing location assignments for frame objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLateralBracing(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref int[] MyType,
	ref int[] Loc,
	ref double[] RD1,
	ref double[] RD2,
	ref double[] Dist1,
	ref double[] Dist2
)
Function GetLateralBracing (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef MyType As Integer(),
	ByRef Loc As Integer(),
	ByRef RD1 As Double(),
	ByRef RD2 As Double(),
	ByRef Dist1 As Double(),
	ByRef Dist2 As Double()
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim MyType As Integer()
Dim Loc As Integer()
Dim RD1 As Double()
Dim RD2 As Double()
Dim Dist1 As Double()
Dim Dist2 As Double()
Dim returnValue As Integer
returnValue = instance.GetLateralBracing(Name,
	NumberItems, FrameName, MyType, Loc,
	RD1, RD2, Dist1, Dist2)
int GetLateralBracing(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<int>^% MyType,
	array<int>^% Loc,
	array<double>^% RD1,
	array<double>^% RD2,
	array<double>^% Dist1,
	array<double>^% Dist2
)
abstract GetLateralBracing :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        MyType : int[] byref *
        Loc : int[] byref *
        RD1 : float[] byref *
        RD2 : float[] byref *
        Dist1 : float[] byref *
        Dist2 : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object.
NumberItems
Type: System.Int32
 The total number of bracing assignments retrieved for the specified frame objects.
FrameName
Type: System.String[]
 This is an array that includes the name of the frame object associated with each bracing assignment.
MyType
Type: System.Int32[]
 This is an array that includes 1 or 2, indicating the bracing type assigned.
Point bracing
Uniform bracing
Loc
Type: System.Int32[]
 This is an array that includes 1, 2, or 3, indicating the bracing location.
Top
Bottom
All (top and bottom)
RD1
Type: System.Double[]
 This is an array that includes the relative location of the point bracing (when MyType = 1) or the start of the uniform bracing (when MyType = 2).
RD2
Type: System.Double[]
 This is an array that includes the relative location of the end of the uniform bracing (when MyType = 2). This item does not apply for point bracing (when MyType = 1).
Dist1
Type: System.Double[]
 This is an array that includes the actual location of the point bracing (when MyType = 1) or the start of the uniform bracing (when MyType = 2). [L]
Dist2
Type: System.Double[]
 This is an array that includes the actual location of the end of the uniform bracing (when MyType = 2). [L] This item does not apply for point bracing (when MyType = 1).
Return Value
Type: Int32
 Returns zero if the lateral bracing location assignments are successfully retrieved, otherwise it returns a nonzero value.
Remarks
 Added in v1.31.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberItems As Integer
   Dim FrameName() As String
   Dim MyType() As Integer
   Dim Loc() As Integer
   Dim RD1() As Double
   Dim RD2() As Double
   Dim Dist1() As Double
   Dim Dist2() As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'assign frame lateral bracing
   ret = SapModel.FrameObj.SetLateralBracing("65", 1, 3, 0.5, 0)
'get frame lateral bracing
   ret = SapModel.FrameObj.GetLateralBracing("65", NumberItems, FrameName, MyType, Loc, RD1, RD2, Dist1, Dist2)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace